---
type: RenderNode
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# RenderNode

`Autodesk.Revit.DB.RenderNode` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NodeName | 2014 | `public string NodeName { get ; }` |